//
//  AppDelegate.h
//  TextVersion
//
//  Created by toby on 04/09/2017.
//  Copyright © 2017 kg.self.edu. All rights reserved.
//

#import <UIKit/UIKit.h>

@interface AppDelegate : UIResponder <UIApplicationDelegate>

@property (strong, nonatomic) UIWindow *window;


@end
  
  
  
  1 初期阶段
	1）300商家 3000用户以上 （预计6个月）
		* 持续优化商家、用户端app
		*用户app端实现多种类型（饭店，奶茶，药店，
						旅行社，超市，汇款）

		*加入 红包、优惠券，热销，分享好礼，商家赞助活动（针对用户	端），批发商广告（针对商家端）

		*收藏商家功能

		*入驻一定量的高端商家（提高自身知名度）

		

		*添加预定桌位功能（中高端饭店，酒店）
		
		* android 端
			
		？日住房的需求（我个人认为是国内来旅游的人多一		点）
		？我不想做 求职，招租（因为信息太杂，对用户不负		责任）
	2）日订单达到2000以上 （6个月以上）

		*加入 微信支付，支付宝支付

		*开通旅游板块

		*话费充值（我想做真正的线上充值）

		*海运物流

		*分析数据，建立大数据模型，分析用户行为

       		* 线下布局，整合资源
	
		
2 发展阶段 （说的话开始越来越虚，但并不代表做的事）


		*进一步根据团队资源，市场环境，深度整合

		*app设计线下至少三个行业（我目前看好：超市，（配送和物流），b2b）

3 持续发展（如果产品能活到这个时候，我们的想法，思路一定比现在旷阔的多，不想说太多细节，因为也说不出）

             * 但是可以肯定一点的是，只要我们还活着，我们扩张的路线一定是东南亚，其他国家市场
	    



**********    参考     ********** 
	国内 饿了吗 美团外卖，百度外卖

	1.foodpanda（新加坡团队）

	2.zomato（印度知名美食点评网站，15年推出线上餐厅zomato order餐厅预约，zomato跟uber合	作，用户可以直接打uber前往所选餐厅。
			
	新加坡公司Temasek领投。zomato从创立初期到现在累计获得2.25亿美元投资，未来他们也会进一步拓宽b2b业务）
	
	3.storific法国订餐app
		跟餐厅合作，通过限定距离和价格搜索附近的餐厅，进入餐厅后 在手机上生成该餐厅的菜单，订单会发送到厨房后台

	4.英国在线外卖品牌 Deliveroo 主打为一些平时不提供外送服务的餐厅提供送餐服务

	5.美国纽约团购类app savored
		提供高端餐厅就餐折扣的平台
	
	6.where to eat
	懒汉app 除两传统的条件搜索餐厅，还可以摇一摇找餐馆（潜在数据收集，摇一摇必须同意发送地理位置到平台，用户打开app我们就可以获取到位置信息）
	

